Repository: City-of-Helsinki/helfeedback
Catalog: feedback/locale/*/LC_MESSAGES/django.po
Languages: fi

source: The user agent string of the user's browser
fi: Käyttäjän selaimen user agent

source: Rating
fi: Arvostelu

source: Body
fi: Palaute

source: URL of page where feedback was sent from
fi: URL, jolta palaute lähetettiin

source: Email
fi: Sähköposti

source: Unsupported notifier type: %s
fi: Epätuettu ilmoitustyyppi: %s

source: New feedback received for {url}
fi: Uusi palaute {url}:ia koskien tullut

source: User agent
fi: Selain

source: Give Us Feedback
fi: Anna palautetta palvelusta

source: How would you rate this service experience?
fi: Kuinka hyvin palvelu vastasi tarpeitasi?

source: Rate us on the scale of 1 (weak) - 4 (good)
fi: Arvostele asteikolla 1 (heikko) - 4 (hyvä)

source: How would you have us improve?
fi: Mitä voisimme vielä kehittää?

source: Please fill this field
fi: Täytä myös tämä kenttä

source: Should you wish for us to contact you, please leave your contact information
fi: Voit jättää yhteystietosi jos haluat että otamme yhteyttä koskien palautettasi

source: Name
fi: Nimi

source: Please fill in an email address
fi: Sähköpostiosoite on väärin.

source: Send
fi: Lähetä

source: Thank you!
fi: Kiitos palautteestasi!
